/* eslint-disable prettier/prettier */

// prettier-ignore
export const RegExpPattern = {
    // Целые числа
    NUMERIC: '\\d*',
    // Позитивные целые числа
    NUMERIC_POSITIVE_SYMBOLS: '[1-9]\\d*',
    // Электронная почта
    EMAIL: '^([_A-Za-z0-9-\\+<>\']+(\\.[_A-Za-z0-9-\\+<>\']+)*)@([A-Za-z0-9-]+(\\.[A-Za-z0-9-]+)*(\\.[A-Za-z]{2,}))$',
    // URL адрес
    URL: '^(https?:\\/\\/(?:www\\.|(?!www))[a-zA-Z0-9][a-zA-Z0-9-]+[a-zA-Z0-9]\\.[^\\s]{2,}|www\\.[a-zA-Z0-9][a-zA-Z0-9-]+[a-zA-Z0-9]\\.[^\\s]{2,}|https?:\\/\\/(?:www\\.|(?!www))[a-zA-Z0-9]+\\.[^\\s]{2,}|www\\.[a-zA-Z0-9]+\\.[^\\s]{2,}|[a-zA-Z0-9]+\\.[^\\s]{2,})',
    // Номер телефона в формате +* (***) ***-****
    TEL: '^\\+[1-9]\\s\\(\\d\\d\\d\\)\\s\\d\\d\\d\\-\\d\\d\\d\\d$',
    // ИНН
    INN: '^(\\d{10}|\\d{12})$',
    // Спец символы, допустимые в логине пароле.
    SPECIAL_SYMBOLS: '[$@$!%*#?&_=+.]+',
    // Символы русского алфавита
    RUSSIAN_SYMBOLS: '[А-яЁё]',
    // Латинские символы в нижнем регистре
    LOWER_LAT: '[a-z]+',
    // Латинские символы в верхнем регистре
    UPPER_LAT: '[A-Z]+',
    // Цифровые символы
    NUMBERS: '[0-9]+',
};
