/** Числовое значение ограничения по количеству символов - до 64 символов */
export const INPUT_RESTRICTION_XS = 64;

/** Числовое значение ограничения по количеству символов - до 128 символов */
export const INPUT_RESTRICTION_S = 128;

/** Числовое значение ограничения по количеству символов - до 256 символов */
export const INPUT_RESTRICTION_M = 256;

/** Числовое значение ограничения по количеству символов - до 512 символов */
export const INPUT_RESTRICTION_L = 512;

/** Числовое значение ограничения по количеству символов - до 1028 символов */
export const INPUT_RESTRICTION_XL = 1028;

/** Ограничение значения числового поля */
export const INPUT_NUMBER_MAX = 10000000000000;
